tylertms/dspic33e-sim/conformance/nvm.c
    dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_BASE + 0x400u, 0x00123456u);
    dspic33_load_program_word(cpu, 0u, OPCODE_RESET);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               program_word(cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE +
                                     0x400u) == 0x00123456u,
           "warm reset preserves persistent program");
    dspic33_reset(cpu, 0u);
    expect(state, program_word(cpu, PERSISTENT_PROGRAM_BASE + 0x400u) == 0x00123456u,
           "cold processor reset preserves persistent program");
}

int main(void) {
    Dspic33 cpu;
    NvmConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize NVM processor");
    if (initialized) {
        configuration_table_view_cases(&state, &cpu);
        reset_and_access_cases(&state, &cpu);
        key_sequence_cases(&state, &cpu);
        key_byte_access_cases(&state, &cpu);
        invalid_operation_cases(&state, &cpu);
        invalid_target_cases(&state, &cpu);
        program_range_cases(&state, &cpu);
        configuration_operation_cases(&state, &cpu);
        pair_and_capture_cases(&state, &cpu);
        row_operation_cases(&state, &cpu);
        erase_operation_cases(&state, &cpu);
        auxiliary_loader_cases(&state, &cpu);
        auxiliary_access_and_execution_cases(&state, &cpu);
        auxiliary_nvm_cases(&state, &cpu);
        stall_and_interrupt_cases(&state, &cpu);
        power_save_cases(&state, &cpu);
        persistent_program_alias_cases(&state, &cpu);
        doze_stall_cases(&state, &cpu);
        async_suppression_cases(&state, &cpu);
        reset_copy_and_failure_cases(&state, &cpu);
        dspic33_destroy(&cpu);
    }
    printf("[nvm-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
